{
  "sources": [
    {
      "title": "fasterthanli.me",
      "feedUrl": "https://fasterthanli.me/index.xml",
      "siteUrl": "https://fasterthanli.me",
      "articles": [
        {
          "id": "https://fasterthanli.me/series/making-our-own-executable-packer/part-18",
          "author": null,
          "description": "<p>Welcome back to the eighteenth and final part of &quot;Making our own executable\npacker&quot;.</p>\n<p>In <a href=\"/series/making-our-own-executable-packer/part-17\">the last article</a>, we had\na lot of fun. We already had a &quot;packer&quot; executable, <code>minipak</code>, which joined\ntogether <code>stage1</code> (a launcher), and a compressed version of whichever executable\nwe wanted to pack.</p>",
          "link": "https://fasterthanli.me/series/making-our-own-executable-packer/part-18",
          "publishedOn": "2021-05-01T07:30:00.000Z",
          "wordCount": 12865,
          "title": "Fine, we'll relocate our own binary!"
        }
      ]
    },
    {
      "title": "A Collection of Unmitigated Pedantry",
      "feedUrl": "https://acoup.blog/feed",
      "siteUrl": "https://acoup.blog",
      "articles": [
        {
          "id": "https://acoup.blog/?p=7418",
          "author": "Bret Devereaux",
          "description": "Note from the Editor: I’m excited that I have our first (hopefully of many!) guest post to share with you and it is a fascinating topic to start with. The history of medicine (and the history of science more generally) is a captivating and important sub-field and a frequent reader-request, but also a place where … Continue reading Meet a Historian: Robin S. Reich on Making Sense of Medieval Medicine: Humors, Weird Animal Parts, and Experiential Knowledge →",
          "link": "https://acoup.blog/2021/05/20/meet-a-historian-robin-s-reich-on-making-sense-of-medieval-medicine-humors-weird-animal-parts-and-experiential-knowledge/",
          "publishedOn": "2021-05-21T03:53:55.000Z",
          "wordCount": 9266,
          "title": "Meet a Historian: Robin S. Reich on Making Sense of Medieval Medicine: Humors, Weird Animal Parts, and Experiential Knowledge"
        },
        {
          "id": "https://acoup.blog/?p=7258",
          "author": "Bret Devereaux",
          "description": "This is the third part of our series (I, II) examining the historical assumptions of Paradox Interactive’s grand strategy computer game set in the early modern period, Europa Universalis IV (which is in turn the start of a yet larger series looking at several of Paradox’s games and how they treat their historical subjects. Last … Continue reading Collections: Teaching Paradox, Europa Universalis IV, Part III: Europa Provincalis →",
          "link": "https://acoup.blog/2021/05/14/collections-teaching-paradox-europa-universalis-iv-part-iii-europa-provincalis/",
          "publishedOn": "2021-05-14T16:49:47.000Z",
          "wordCount": 35586,
          "title": "Collections: Teaching Paradox, Europa Universalis IV, Part III: Europa Provincalis"
        },
        {
          "id": "https://acoup.blog/?p=7135",
          "author": "Bret Devereaux",
          "description": "This is the second part in a series (I) that examines the historical assumptions behind Paradox Interactive’s grand strategy computer game set in the early modern period, Europa Universalis IV (EU4). Last time, we took a look at how EU4 was a game fundamentally about states and how the decision to orient the game in … Continue reading Collections: Teaching Paradox, Europa Universalis IV, Part II: Red Queens →",
          "link": "https://acoup.blog/2021/05/07/collections-teaching-paradox-europa-universalis-iv-part-ii-red-queens/",
          "publishedOn": "2021-05-07T05:23:09.000Z",
          "wordCount": 25959,
          "title": "Collections: Teaching Paradox, Europa Universalis IV, Part II: Red Queens"
        },
        {
          "id": "https://acoup.blog/?p=6992",
          "author": "Bret Devereaux",
          "description": "This is the first post in a series that will be examining the historical assumptions of Paradox Interactive’s grand strategy computer game set in the early modern period, Europa Universalis IV. And this series will in turn be part of a larger series looking at several of Paradox’s games and how they treat their historical … Continue reading Collections: Teaching Paradox, Europa Universalis IV, Part I: State of Play →",
          "link": "https://acoup.blog/2021/04/30/collections-teaching-paradox-europa-univeralis-iv-part-i-state-of-play/",
          "publishedOn": "2021-04-30T06:10:40.000Z",
          "wordCount": 26798,
          "title": "Collections: Teaching Paradox, Europa Universalis IV, Part I: State of Play"
        }
      ]
    },
    {
      "title": "<antirez>",
      "feedUrl": "http://antirez.com/rss",
      "siteUrl": "http://antirez.com",
      "articles": [
        {
          "id": "http://antirez.com/news/135",
          "author": null,
          "description": "One year ago I paused my programming life and started writing a novel, with the illusion that my new activity was deeply different than the previous one. A river of words later, written but more often rewritten, I’m pretty sure of the contrary: programming big systems and writing novels have many common traits and similar processes.\n\nThe most obvious parallel between the two activities is that in both of them you write something. Code is not prose written in a natural language, yet it has a set of fixed rules (a grammar), certain forms that most programmers will understand as natural and others that, while formally correct, will sound hard to grasp.\nThere is, however, a much deeper connection between the two activities: a good program and a good novel are both the sum of local and global e…",
          "link": "http://antirez.com/news/135",
          "publishedOn": "2021-05-14T09:47:18.000Z",
          "wordCount": 795,
          "title": "Programming and Writing"
        }
      ]
    },
    {
      "title": "Martin Kleppmann's blog",
      "feedUrl": "https://feeds.feedburner.com/martinkl",
      "siteUrl": "http://martin.kleppmann.com/",
      "articles": []
    },
    {
      "title": "The Old New Thing",
      "feedUrl": "https://devblogs.microsoft.com/oldnewthing/feed/",
      "siteUrl": "https://devblogs.microsoft.com/oldnewthing",
      "articles": [
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105255",
          "author": "Raymond Chen",
          "description": "A customer wanted to be able to convert from IANA time zones and Windows registry-based time zones. Is there a function for doing that?\nThe post How can I convert between IANA time zones and Windows registry-based time zones? appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210527-00/?p=105255",
          "publishedOn": "2021-05-27T14:00:00.000Z",
          "wordCount": 1816,
          "title": "How can I convert between IANA time zones and Windows registry-based time zones?"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105252",
          "author": "Raymond Chen",
          "description": "In Win32, there is the concept of a clipboard owner. How does that work?\nCall Open­Clipboard(hwnd) passing the window that you want to become the new clipboard owner.\nThe post How ownership of the Windows clipboard is tracked in Win32 appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210526-00/?p=105252",
          "publishedOn": "2021-05-26T14:00:00.000Z",
          "wordCount": 1824,
          "title": "How ownership of the Windows clipboard is tracked in Win32"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105250",
          "author": "Raymond Chen",
          "description": "Something that catches out everybody the first time they encounter it is that Windows device-independent bitmaps are upside down, in the sense that the first row of pixels corresponds to the bottom scan line of the image, and subsequent rows of pixels continue upward,\nThe post Why are device-independent bitmaps upside down? appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210525-00/?p=105250",
          "publishedOn": "2021-05-25T14:00:00.000Z",
          "wordCount": 2142,
          "title": "Why are device-independent bitmaps upside down?"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105240",
          "author": "Raymond Chen",
          "description": "The Windows Runtime supports static members, which are members that apply to a class as a whole, rather than to particular instances of a class. The expectation is that these members are exposed via the language projection as static members of some language-specific representation of the class.\nThe post On static methods in the Windows Runtime and C++/WinRT appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210524-00/?p=105240",
          "publishedOn": "2021-05-24T14:00:00.000Z",
          "wordCount": 1924,
          "title": "On static methods in the Windows Runtime and C++/WinRT"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105234",
          "author": "Raymond Chen",
          "description": "The network usage information we obtained  last time can also be attributed, so you can see who is consuming all of your bandwidth.\nThe post Obtaining attributed network usage information from the Windows Runtime appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210521-00/?p=105234",
          "publishedOn": "2021-05-21T14:00:00.000Z",
          "wordCount": 1581,
          "title": "Obtaining attributed network usage information from the Windows Runtime"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105232",
          "author": "Raymond Chen",
          "description": "Network usage information on Windows can be obtained from classes in the Windows.Networking.Connectivity namespace. The Network­Information class is your starting point.\nThe post Obtaining network usage information from the Windows Runtime appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210520-00/?p=105232",
          "publishedOn": "2021-05-20T14:00:00.000Z",
          "wordCount": 1506,
          "title": "Obtaining network usage information from the Windows Runtime"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105229",
          "author": "Raymond Chen",
          "description": "Some time ago, I showed  how to use Windows Runtime objects from C# desktop apps. But that solution only went part of the way. It gave you access to the objects, but it didn’t provide a way to await any asynchronous operations.\nThe post Awaiting Windows Runtime asynchronous operations from C# desktop apps appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210519-00/?p=105229",
          "publishedOn": "2021-05-19T14:00:00.000Z",
          "wordCount": 1008,
          "title": "Awaiting Windows Runtime asynchronous operations from C# desktop apps"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105225",
          "author": "Raymond Chen",
          "description": "Some time ago, I noted  the curse of the leading zero. But sometimes the leading zero can be a blessing.\nThe post The blessing of the leading zero appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210518-00/?p=105225",
          "publishedOn": "2021-05-18T14:00:00.000Z",
          "wordCount": 1394,
          "title": "The blessing of the leading zero"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105217",
          "author": "Raymond Chen",
          "description": "Retro-computing aficionado  Gravis noticed that  up until Windows 95, horizontal window positions are quantized. “Do you know anything about that?”\nThe post Why did Windows 95 keep window coordinates at multiples of 8? appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210517-00/?p=105217",
          "publishedOn": "2021-05-17T14:00:00.000Z",
          "wordCount": 2152,
          "title": "Why did Windows 95 keep window coordinates at multiples of 8?"
        },
        {
          "id": "https://devblogs.microsoft.com/oldnewthing/?p=105214",
          "author": "Raymond Chen",
          "description": "A customer had a shell namespace extension and discovered that when the user dragged an item, their custom drop target gets Drag­Enter and Drag­Leave method calls as expected, but the Drag­Over method calls are being throttled. Specifically, they get a new Drag­Over call only if the keyboard modifier state changes.\nThe post Why isn’t my shell namespace extension getting every single DragOver mouse message? appeared first on The Old New Thing.",
          "link": "https://devblogs.microsoft.com/oldnewthing/20210514-00/?p=105214",
          "publishedOn": "2021-05-14T14:00:00.000Z",
          "wordCount": 1158,
          "title": "Why isn’t my shell namespace extension getting every single DragOver mouse message?"
        }
      ]
    },
    {
      "title": "Matt Mullenweg",
      "feedUrl": "https://ma.tt/feed",
      "siteUrl": "https://ma.tt",
      "articles": [
        {
          "id": "https://ma.tt/?p=54256",
          "author": "Matt",
          "description": "Today marks eighteen years since the very first release of WordPress. I consider myself so lucky to have co-founded the project alongside Mike Little. Who could have imagined that our nights and weekends hacking on blogging software, a fork of b2/cafelog, could turn into something powering over 40% of the web? Or that nearly twenty […]",
          "link": "https://ma.tt/2021/05/wordpress-18/",
          "publishedOn": "2021-05-27T22:31:23.000Z",
          "wordCount": 353,
          "title": "WordPress 18"
        },
        {
          "id": "https://ma.tt/?p=54177",
          "author": "Matt",
          "description": "My streaming setup post last year got an amazing reception — there are similar setups being used by executives across the board, from companies fundraising to several I know of with 100B+ valuations. Since that original setup, I’ve updated my own usage of hardware and software combinations to achieve similar or better results for about a […]",
          "link": "https://ma.tt/2021/05/2021-streaming-kit/",
          "publishedOn": "2021-05-21T23:29:19.000Z",
          "wordCount": 1659,
          "title": "2021 Streaming Kit"
        },
        {
          "id": "https://ma.tt/?p=54194",
          "author": "Matt",
          "description": "Squarespace filed their S-1 last month, and went a direct listing route for their stock today under the ticker SQSP, so I’ve been getting lots of questions on my thoughts on their business. It’s easier to share here in a blog than individually. Squarespace’s CEO Anthony Casalena is a thoughtful, creative leader. It’s amazing what […]",
          "link": "https://ma.tt/2021/05/squarespace-direct-listing/",
          "publishedOn": "2021-05-20T02:37:49.000Z",
          "wordCount": 580,
          "title": "Squarespace Direct Listing"
        }
      ]
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/2021/05/24/blog-about-what-you-ve-struggled-with/",
          "author": null,
          "description": "I was talking to Jemma recently about what stops people\nfrom blogging. One barrier that stood out to me was: it’s hard to identify\nwhich things you know will be useful to other people!\nThe process I use for a lot of my blog posts is:\nStruggle with something (usually computer-related)\nEventually (days or months or years later), figure out how to solve some of\nthe problems I had\nWrite a blog post about what helped me\nI think this approach is effective because if I struggled with something,\nthere’s a pretty good chance that other people are struggling with it too, and\nwhat I learned is likely to be useful to at least some of them!\nObviously this isn’t the only approach to blogging, but it’s my approach, so\nthat’s what I’m going to write about here :). I’ll give a few examples of\nspecific blog…",
          "link": "https://jvns.ca/blog/2021/05/24/blog-about-what-you-ve-struggled-with/",
          "publishedOn": "2021-05-24T13:59:07.000Z",
          "wordCount": 1869,
          "title": "Blog about what you've struggled with"
        },
        {
          "id": "https://jvns.ca/blog/2021/05/17/how-to-look-at-the-stack-in-gdb/",
          "author": null,
          "description": "I was chatting with someone yesterday and they mentioned that they don’t really\nunderstand exactly how the stack works or how to look at it.\nSo here’s a quick walkthrough of how you can use gdb to look at the stack of a C\nprogram. I think this would be similar for a Rust program, but I’m going to use\nC because I find it a little simpler for a toy example and also you can do Terrible\nThings in C more easily.\nour test program\nHere’s a simple C program that declares a few variables and reads two strings\nfrom standard input. One of the strings is on the heap, and one is on the\nstack.\n#include <stdio.h>\n#include <stdlib.h>\n\nint main() {\n    char stack_string[10] = \"stack\";\n    int x = 10;\n    char *heap_string;\n\n    heap_string = malloc(50);\n\n    printf(\"Enter a string for the stack: \");\n    ge…",
          "link": "https://jvns.ca/blog/2021/05/17/how-to-look-at-the-stack-in-gdb/",
          "publishedOn": "2021-05-17T09:14:37.000Z",
          "wordCount": 2505,
          "title": "How to look at the stack with gdb"
        },
        {
          "id": "https://jvns.ca/blog/2021/05/11/what-s-the-osi-model-/",
          "author": null,
          "description": "TCP/IP is the set of networking protocols that we use on the modern internet –\nTCP, UDP, IP, ARP, ICMP, DNS, etc. When I talk about “networking”, I’m\nbasically always talking about TCP/IP.\nMany explanations of TCP/IP start with something called the “OSI model”. I\ndon’t use the OSI model when explaining networking because when I first\nstarted learning about internet networking I found all of the OSI model\nexplanations really confusing – it wasn’t clear to me at all how the OSI\nmodel corresponded to TCP/IP.\nSo if you’re just starting to learn about networking and you’re confused about\nthe OSI model, here’s an explanation of how it corresponds to TCP/IP, how\nit doesn’t, and why it’s safe to mostly just ignore it if you don’t find it helpful.\nthe OSI model has 7 layers\nLet’s very briefly discu…",
          "link": "https://jvns.ca/blog/2021/05/11/what-s-the-osi-model-/",
          "publishedOn": "2021-05-11T14:58:41.000Z",
          "wordCount": 1047,
          "title": "The OSI model doesn't map well to TCP/IP"
        },
        {
          "id": "https://jvns.ca/blog/2021/05/02/publishing-comics/",
          "author": null,
          "description": "Hello! As you probably know, I write a lot of comics about programming, and I publish collections of them as zines you can buy at https://wizardzines.com.\nI also usually post the comics on Twitter as I write them. But there are a lot of problems with just posting them to Twitter, like:\nthe pages are hard to find. For example, if you want to find the one on\nsocat, you can search twitter\nand you’ll find it, but then you have to somehow magically guess what words I\nused in the tweet, and also sort through a bunch of other tweets.\nthey’re annoying to link to. Twitter isn’t really the best user interface for this sort of thing.\nI can’t make updates. Twitter doesn’t have an edit button!\nwork that never made it into a zine is basically impossible to find. For example I\nwrote 12 pages of a sequel …",
          "link": "https://jvns.ca/blog/2021/05/02/publishing-comics/",
          "publishedOn": "2021-05-02T11:41:59.000Z",
          "wordCount": 674,
          "title": "I put all of my comics online!"
        }
      ]
    },
    {
      "title": "John D. Cook",
      "feedUrl": "https://www.johndcook.com/blog/rss",
      "siteUrl": "https://www.johndcook.com/blog",
      "articles": [
        {
          "id": "https://www.johndcook.com/blog/?p=76689",
          "author": "John",
          "description": "The plastic ratio is given by The Dutch architect Dom Hans van der Laan gave the number this name in 1928. He used “plastic” as an allusion to a 3D construction of the number, analogous to the 2D construction of the golden ratio. Here’s a plastic rectangle, a rectangle whose sides have the proportions of […]\nPlastic number feels plastic first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/27/plastic-number-feels-plastic/",
          "publishedOn": "2021-05-27T16:50:54.000Z",
          "wordCount": 352,
          "title": "Plastic number feels plastic"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=76612",
          "author": "John",
          "description": "What is the distribution of coins you’d expect to see in a coin jar? This post will make a guess based on the following simplifying assumptions. Change is in US currency, with coins in denominations of 1, 5, 10, and 25 cents. The change due in a transaction is uniformly distributed from 0 to 99 […]\nCoin distribution first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/26/coin-distribution/",
          "publishedOn": "2021-05-26T16:02:36.000Z",
          "wordCount": 737,
          "title": "Coin distribution"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=76593",
          "author": "John",
          "description": "The exponential sum page on this site draws lines between the consecutive partial sums of where m is the month, d is the day, and y is the last two digits of the year. I get mixed feedback on my exponential sum page. Some people find it even more interesting than I do and have […]\nWhy exponential sums are interesting first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/26/why-exponential-sums/",
          "publishedOn": "2021-05-26T13:18:19.000Z",
          "wordCount": 616,
          "title": "Why exponential sums are interesting"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=76460",
          "author": "John",
          "description": "Lawyers write Word documents and mathematicians write LaTeX documents. Of course makes collaboration awkward, but there are ways to make it better. One solution is to simply use Word. People who use LaTeX probably know how to use Word, even if they’d rather not, and asking someone else to learn LaTeX is a non-starter. So […]\nLaTeX and Lawyers first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/24/latex-and-lawyers/",
          "publishedOn": "2021-05-24T15:56:44.000Z",
          "wordCount": 624,
          "title": "LaTeX and Lawyers"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74855",
          "author": "John",
          "description": "I first heard of the book A Pattern Language sometime in the 1990s. I had left academia, for the first time [1], and was working as a software developer. Although the book is about architecture, software developers were exited about the book because of its analogs to software development patterns. The “Gang of Four” book […]\nA Pattern Language first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/22/a-pattern-language/",
          "publishedOn": "2021-05-22T17:12:31.000Z",
          "wordCount": 684,
          "title": "A Pattern Language"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=76141",
          "author": "John",
          "description": "Email subscription for this web site has been provided by Google Feedburner. This service is going away in July. I don’t know yet what I will replace Feedburner with. Do any of you know of an alternative that automatically sends out email when there’s a new post? I use Mail Chip to distribute by monthly […]\nEmail subscription changing first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/19/email-subscription-changing/",
          "publishedOn": "2021-05-19T19:34:28.000Z",
          "wordCount": 916,
          "title": "Email subscription changing"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75977",
          "author": "John",
          "description": "This post is an expansion on a comment by Nathan Hannon: My favorite definition of e is “the base whose version of the decibel is the largest”. I hadn’t seen that before. Sounds interesting. What does it mean? First attempt My first thought was that the statement meant that the function b logb(x) is largest […]\nThe base with the largest decibel first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/18/the-base-with-the-largest-decibel/",
          "publishedOn": "2021-05-18T12:40:50.000Z",
          "wordCount": 513,
          "title": "The base with the largest decibel"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75945",
          "author": "John",
          "description": "I’ve written before about Rényi entropy Hq and most recently q-log entropy Sq, two generalizations of Shannon entropy. There are simple equations relating Rényi entropy and q-log entropy if we measure both in nats: I mentioned in the post on q-log entropy that there were two possible ways it could be defined. The equation above […]\nRelating Rényi entropy and q-log entropy first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/18/renyi-and-qlog-entropy/",
          "publishedOn": "2021-05-18T12:38:40.000Z",
          "wordCount": 279,
          "title": "Relating Rényi entropy and q-log entropy"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75716",
          "author": "John",
          "description": "The most common way to quantify entropy is Shannon entropy. That’s what people usually mean when they say “entropy” without further qualifications. A while back I wrote about Renyi entropy as a generalization of Shannon entropy. This time I’ll explore a different generalization called q-log entropy, a.k.a. Tsallis entropy. The definition of Shannon entropy includes […]\nGeneralizing Shannon entropy with q-logs first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/17/qlog-tsallis-entropy/",
          "publishedOn": "2021-05-17T14:42:40.000Z",
          "wordCount": 688,
          "title": "Generalizing Shannon entropy with q-logs"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75695",
          "author": "John",
          "description": "Last week my family and I made a tour of the five national parks in Utah. In Canyonlands National Park, my son-in-law noticed some grates at the bottom of a hill just a few feet off the road we were walking on. The area was not restricted. We walked over to investigate and found that […]\nStumbling on an abandoned uranium mine first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/17/uranium-mine/",
          "publishedOn": "2021-05-17T11:50:41.000Z",
          "wordCount": 442,
          "title": "Stumbling on an abandoned uranium mine"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75691",
          "author": "John",
          "description": "Logarithms in all bases are proportional. Specifically loga(x) = logb(x) / logb(a) for any bases a and b. One way to read this is to say that if you already know about logarithms base b, logarithms base a aren’t anything fundamentally new [1]. They’re proportional to logarithms base b, and in fact the proportionality constant […]\nDecibel to log in new base first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/16/decibel-to-log/",
          "publishedOn": "2021-05-17T02:44:18.000Z",
          "wordCount": 676,
          "title": "Decibel to log in new base"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75245",
          "author": "John",
          "description": "Here are the five most popular posts so far this year. Self-reproducing cellular automata Simple trig approximations How to mentally calculate logs Trig functions across programming languages Gell-Mann amnesia The posts above had the most page views. But just counting page views doesn’t measure what regular readers necessarily most enjoy reading. It’s heavily influenced by […]\nMost popular posts this year first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/12/most-popular-posts-this-year/",
          "publishedOn": "2021-05-12T12:00:24.000Z",
          "wordCount": 283,
          "title": "Most popular posts this year"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75327",
          "author": "John",
          "description": "The trace of a square matrix is the sum of the elements on its main diagonal. The order in which you multiply matrices matters: in general, matrix multiplication is not commutative. But the trace of a product of matrices may or may not depend on the order of multiplication. Specifically, trace doesn’t change if you […]\nCyclic permutations and trace first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/10/cyclic-permutations-and-trace/",
          "publishedOn": "2021-05-10T12:42:57.000Z",
          "wordCount": 628,
          "title": "Cyclic permutations and trace"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75292",
          "author": "John",
          "description": "3Blue1Brown has a nice new video on how to calculate the eigenvalues of 2×2 matrices. The most common way to find the eigenvalues of a 2×2 matrix A is working straight from the definition, solving det(A – λI) = 0. This is fine when you’re learning what eigenvalues are. But if you’ve already learned all […]\nTrick for 2×2 eigenvalues first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/07/trick-for-2x2-eigenvalues/",
          "publishedOn": "2021-05-08T01:18:36.000Z",
          "wordCount": 369,
          "title": "Trick for 2×2 eigenvalues"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75281",
          "author": "John",
          "description": "Here’s a way to find a 95% confidence interval for any parameter θ. With probability 0.95, return the real line. With probability 0.05, return the empty set. Clearly 95% of the time this procedure will return an interval that contains θ. This example shows the difference between a confidence interval and a credible interval. A […]\nUniversal confidence interval first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/07/universal-confidence-interval/",
          "publishedOn": "2021-05-07T19:17:25.000Z",
          "wordCount": 586,
          "title": "Universal confidence interval"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75265",
          "author": "John",
          "description": "When you leave the comfort of the real numbers, you might be mistaken about what a polynomial is. Suppose you’re looking at polynomials over some finite field. Why would you do that? Numerous practical applications, but that’s a topic for another post. You look in some reference that’s talking about polynomials and you see things […]\nWhat is a polynomial? first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/07/what-is-a-polynomial/",
          "publishedOn": "2021-05-07T16:50:19.000Z",
          "wordCount": null,
          "title": "What is a polynomial?"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75178",
          "author": "John",
          "description": "Suppose you do N trials of something that can succeed or fail. After your experiment you want to present a point estimate and a confidence interval. Or if you’re a Bayesian, you want to present a posterior mean and a credible interval. The numerical results hardly differ, though the two interpretations differ. If you got […]\nConfidence interval widths first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/06/confidence-interval-widths/",
          "publishedOn": "2021-05-06T16:15:30.000Z",
          "wordCount": null,
          "title": "Confidence interval widths"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=75017",
          "author": "John",
          "description": "The previous post looked at a cellular automaton introduced by Edward Fredkin. It has only two states: a cell is on or off. At each step, each cell is set to the sum of the states of the neighboring cells mod 2. So a cell is on if it had an odd number neighbors turned […]\nMulticolor reproducing cellular automata first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/03/multicolor-reproducing-ca/",
          "publishedOn": "2021-05-03T23:48:57.000Z",
          "wordCount": 871,
          "title": "Multicolor reproducing cellular automata"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74962",
          "author": "John",
          "description": "Edward Fredkin is best known these days for the Fredkin gate, a universal reversible circuit. I recently found out that Fredkin was one of the pioneers in cellular automata. His student Edwin Banks describes a cellular automaton introduced by Fredkin [1]. Edward Fredkin of MIT has described the following interesting cellular space. If the states […]\nSelf-reproducing cellular automata first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/03/self-reproducing-cellular-automata/",
          "publishedOn": "2021-05-03T11:41:58.000Z",
          "wordCount": 862,
          "title": "Self-reproducing cellular automata"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74884",
          "author": "John",
          "description": "The other day I woke up with a song in my head I hadn’t heard in a long time, the hymn Beneath the Cross of Jesus. The name of the tune is St. Christopher. When I thought about the tune, I realized it has some fairly sophisticated harmony. My memory of the hymns I grew […]\nHumming St. Christopher first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/01/humming-st-christopher/",
          "publishedOn": "2021-05-02T00:39:21.000Z",
          "wordCount": 634,
          "title": "Humming St. Christopher"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74845",
          "author": "John",
          "description": "The previous post looked at repeatedly applying the function s(n) which is the sum of the divisors of n less than n. It is an open question whether the sequence s( s( s( … s(n) … ) ) ) always converges or enters a loop. In fact, it’s an open question of whether the sequence […]\nAliquot ratio distribution first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/01/aliquot-ratio-distribution/",
          "publishedOn": "2021-05-01T15:06:44.000Z",
          "wordCount": 564,
          "title": "Aliquot ratio distribution"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74784",
          "author": "John",
          "description": "Let s(n) be the sum of the proper divisors of n, the divisors less than n itself. A number n is called excessive, deficient, or perfect depending on whether s(n) – n is positive, negative, or 0 respectively, as I wrote about a few days ago. The number s(n) is called the aliquot sum of […]\nThe iterated aliquot problem first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/05/01/the-iterated-aliquot-problem/",
          "publishedOn": "2021-05-01T13:20:47.000Z",
          "wordCount": 816,
          "title": "The iterated aliquot problem"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74748",
          "author": "John",
          "description": "The term “cologarithm” was once commonly used but now has faded from memory. Here’s a plot of the frequency of the terms cololgarithm and colog from Google’s Ngram Viewer. The cologarithm base b is the logarithm base 1/b, or equivalently, the negative of the logarithm base b. cologb x = log1/b x = -logb x […]\nCologarithms and Entropy first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/30/cologarithm/",
          "publishedOn": "2021-04-30T16:54:22.000Z",
          "wordCount": null,
          "title": "Cologarithms and Entropy"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74746",
          "author": "John",
          "description": "When students learn about decimals, they’re told that every fraction either has a terminating decimal expansion or a repeating decimal expansion. The previous post gives a constructive proof of the converse: given a repeating fraction (in any base) it shows how to find what rational number it corresponds to. Maybe you learned this so long […]\nCorollary of a well-known fact first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/30/corollary-of-a-well-known-fact/",
          "publishedOn": "2021-04-30T15:58:19.000Z",
          "wordCount": null,
          "title": "Corollary of a well-known fact"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74738",
          "author": "John",
          "description": "My previous post ended with a discussion of repeating binary decimals such as 0.00110011…two = 1/5. For this post I’ll explain how calculations like that are done, how to convert a repeating decimal in any base to a fraction. First of all, we only need to consider repeating decimals of the form 0.1b, 0.01b, 0.001b, […]\nRepeating decimals in any base first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/30/repeating-decimals-in-any-base/",
          "publishedOn": "2021-04-30T12:12:46.000Z",
          "wordCount": null,
          "title": "Repeating decimals in any base"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74707",
          "author": "John",
          "description": "Yesterday I wrote about the bits in powers of 3. That post had a low-resolution image, which has its advantages, but here’s a higher resolution image that also has its advantages. The image looks chaotic. I say this in the colloquial sense, not in the technical sense as in period three implies chaos. I just […]\nChaotic image out of regular slices first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/29/regular-slices/",
          "publishedOn": "2021-04-30T00:56:13.000Z",
          "wordCount": 466,
          "title": "Chaotic image out of regular slices"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74675",
          "author": "John",
          "description": "The previous post showed that the bits of prime powers look kinda chaotic. When you plot them, they form a triangular shape because the size of the numbers is growing. The numbers are growing geometrically, so their binary representations are growing linearly. Here’s the plot for powers of 5: You can crop the triangle so […]\nEvolution of random number generators first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/29/reinventing-rng/",
          "publishedOn": "2021-04-29T14:04:41.000Z",
          "wordCount": 673,
          "title": "Evolution of random number generators"
        },
        {
          "id": "https://www.johndcook.com/blog/?p=74643",
          "author": "John",
          "description": "I was thumbing through A New Kind of Science [1] and one of the examples that jumped out at me was looking at the bits in the binary representation of the powers of 3. I wanted to reproduce the image myself and here’s the result. Here a white square represents a 1 and a blue […]\nPowers of 3 in binary first appeared on John D. Cook.",
          "link": "https://www.johndcook.com/blog/2021/04/28/powers-of-3-in-binary/",
          "publishedOn": "2021-04-29T01:31:32.000Z",
          "wordCount": null,
          "title": "Powers of 3 in binary"
        }
      ]
    },
    {
      "title": "Feross.org",
      "feedUrl": "https://feross.org/atom.xml",
      "siteUrl": "https://feross.org",
      "articles": []
    },
    {
      "title": "ridiculous_fish",
      "feedUrl": "https://ridiculousfish.com/blog/atom.xml",
      "siteUrl": "http://ridiculousfish.com/blog/",
      "articles": [
        {
          "id": "http://ridiculousfish.com/blog/posts/benchmarking-libdivide-m1-avx512.html",
          "author": null,
          "description": "libdivide is fish’s library for speeding up integer division by runtime constants. It works by replacing divide instructions with cheaper multiplications and shifts.\nlibdivide supports SIMD, and recently gained support for AVX-512 and ARM NEON. Let’s benchmark on an Intel Xeon and Apple’s M1.\nTest Setup\nThe microbenchmark is a sum-of-quotients function, like:\nuint32_t sumq(const uint32_t *vals, size_t count, uint32_t d) {\n    uint32_t sum = 0;\n    for (size_t i=0; i < count; i++)\n        sum += vals[i] / d; // this division is the bottleneck\n    return sum;\n}\n\n\nThe execution time of this function is dominated by the divide. It may be optimized with libdivide:\nuint32_t sumq(const uint32_t *vals, size_t count, uint32_t d) {\n    libdivide::divider<uint32_t> div(d);\n    uint32_t sum = 0;\n    f…",
          "link": "http://ridiculousfish.com/blog/posts/benchmarking-libdivide-m1-avx512.html",
          "publishedOn": "2021-05-12T07:00:00.000Z",
          "wordCount": 802,
          "title": "Benchmarking division and libdivide on Apple M1 and Intel AVX512"
        },
        {
          "id": "http://ridiculousfish.com/blog/posts/labor-of-division-episode-v.html",
          "author": null,
          "description": "Last post explored Algorithm D, and some improvements for the 3 ÷ 2 = 1 digit case. This post presents a narrowing division algorithm, improving upon the widely used “divlu” function from Hacker’s Delight. I am optimistic that these ideas are original.\ndivlu is a narrowing division: it divides a 4 digit number by a 2 digit number, producing a 2 digit quotient and remainder. This is achieved by specializing Algorithm D for 4-digit dividend and 2-digit divisor.\nq̂ is an estimated quotient digit. It is quite close to the quotient digit q; it may be exactly the same, or larger by 1 or 2, and that’s all! The tricky parts of divlu is “correcting” q̂ to the true digit, by subtracting 0, 1, or 2.\nHere is the correction step from Hacker’s Delight:\nagain1:\n   if (q1 >= b || q1*vn0 > b*rhat + un1) {\n…",
          "link": "http://ridiculousfish.com/blog/posts/labor-of-division-episode-v.html",
          "publishedOn": "2021-04-29T07:00:00.000Z",
          "wordCount": 1534,
          "title": "Labor of Division (Episode V): Faster Narrowing Division"
        }
      ]
    },
    {
      "title": "Nick Craver",
      "feedUrl": "https://nickcraver.com/blog/feed.xml",
      "siteUrl": "https://nickcraver.com/blog",
      "articles": []
    },
    {
      "title": "the morning paper",
      "feedUrl": "https://blog.acolyer.org/feed",
      "siteUrl": "https://blog.acolyer.org",
      "articles": []
    },
    {
      "title": "Coding Horror",
      "feedUrl": "https://blog.codinghorror.com/rss/",
      "siteUrl": "https://blog.codinghorror.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.9.0"
}